"""
엔드포인트가 0 0, 125 0, 250 0, 125 125, 0 250, 0 125가 되겠으며 각 지점을 연결하는 
변 위에 점을 입력으로 주어졌을 때의 기준을 판별하여 문제를 풀이하였음
"""
x, y = map(int, input().split())
S = 125 * 125
if x == 0:
    if y == 0:
        x2 = y2 = 125.00
    elif 0 < y <= 125:
        x2 = 2 * S / (250 - y)
        y2 = 250 - x2
    elif 125 < y <= 250:
        x2 = 2 * S / y
        y2 = 0
elif y == 0:
    if 0 < x <= 125:
        y2 = 2 * S / (250 - x)
        x2 = 250 - y2
    elif 125 < x <= 250:
        y2 = 2 * S / x
        x2 = 0
else:
    if x == y:
        x2 = y2 = 0
    elif x > y:
        x2 = 0
        y2 = 250 - (2 * S / x)
    else:
        y2 = 0
        x2 = 250 - (2 * S / y)
print(f'{x2:.2f} {y2:.2f}')