"""
주어진 입력을 변환하여 출력하는 문제로
다음과 같이 입력, 출력을 딕셔너리 자료 구조를 이용하여 만들었음
그리고 입력에 제한조건이 없어 try except문으로 EOFError를 잡아 제때에 멈추도록 하였음

+) 문제이름을 문제의 조건대로 적용하여 풀면 '쿼티'라는 단어가 됨
"""
move_left = {'=': '-', '-': '0', '0': '9', '9': '8', '8': '7', '7': '6',
             '6': '5', '5': '4', '4': '3', '3': '2', '2': '1', '1': '`',
             '\\': ']', ']': '[', '[': 'P', 'P': 'O', 'O': 'I', 'I': 'U', 
             'U': 'Y', 'Y': 'T', 'T': 'R', 'R': 'E', 'E': 'W', 'W': 'Q',
             "'": ';', ';': 'L', 'L': 'K', 'K': 'J', 'J': 'H', 'H': 'G',
             'G': 'F', 'F': 'D', 'D': 'S', 'S': 'A', 
             '/': '.', '.': ',', ',': 'M', 'M': 'N', 'N': 'B', 'B': 'V', 
             'V': 'C', 'C': 'X', 'X': 'Z', ' ': ' ',}

while True:
    try:
        sentence = input()
        decode = []
        for char in sentence:
            decode.append(move_left[char])
        print(''.join(decode))
    except EOFError:
        break